#주석이란 ?
#주석은 컴퓨터에게 명령을 전달할시(컴파일시) 예외처리됩니다.
#즉 주석처리된 문장은 실행되어지지 않습니다.
# 주석은 크게 행주석(줄주석)과 블록주석으로 나뉩니다.
# 행주석은 그 행에서만 적용되어지고 줄이 바뀌면 해제됩니다.
# 행주석은 #기호를 이용해서 주석 처리 합니다.

#주석은 이렇게 불필요한 코드를 예외처리합니다. # print("야호~오늘은 파이썬 둘째 날입니다.)
'''
블록주석은 이렇게 따옴표 3개를 이용해서 시작과 범위의 끝을 지정해주면 됩니다.
주로 연속된 코드를 예외처리 할 때 사용합니다.
또한 보고서를 작성하는 용도로도 사용되어지기도 합니다.
'''
print("hello")# 또는 이렇게 그 행의 설명(코멘트)를 작성하는 용도로 사용되어집니다.
print("python 첫날 입니다")

print("python을 시작해 볼까요")

print("쌍따옴포 안의 내용 출력"); print("이어 쓰기 실행")
print("이어쓰기;"); print(); print(";(쎄미콜론이라고 읽는다)")