print("Hello Python");
print("Hello \nPython");
print("재밌는"); print("Python")
print("Hello"
      "Python"
      "Start")
print("Hello\n"
      "Python\n"
      "Start")

print("저의 이름은 홍길동 입니다\n" 
      "저의 나이는 20살 입니다\n"       
      "주소는 산골자기 입니다")

print("저의 이름은 홍길동 입니다")
print("저의 나이는 20살 입니다")
print("주소는 산골자기 입니다")

print("123456781234567812345678123456781234567812345678")
print("Have\t"  "a\t"   "Good\t"    "Time.");
print("1234567\t"   "1\t"   "12345678\t"    "123");
print("대한민국\t만세\t대한독립만세\t만만세")

print("쌍 따옴표\"")

print("홋 따옴표 ' ")

print('쌍 따옴표 " ')

print('홋 따옴표 \' ')

print('표현 \ 방식')
print('표현 \1 방식')
print('표현 \2 방식')
print('표현 \3 방식')
print('표현 \4 방식')
print('표현 \5 방식')
print('표현 \6 방식')
print('표현 \7 방식')
print('표현 \8 방식')
print('표현 \9 방식')
print('표현 \10 방식')
print('표현 \150 방식')
print('표현 \200 방식')
print('표현 \11 방식')

print('표현 \\2 방식')
#print('표현 방식\') #error code
print('표현 방식\\')

print("================================")
print("\t /)/)")
print("\t(  ..)")
print("\t(  >♡")
print("  Have a Good Time.")
print("================================")

print("\t\t#### 회비 정보 ####")
print("=================================================")
print("이름\t\t나이\t전화번호\t회비")
print("=================================================")
print('홍기동\t\t"15"\t010-123-1234\t\\20,000')
print('임꺽정\t\t"20"\t010-234-2345\t\\30,000')
print('김말이\t\t"28"\t010-345-3456\t\\50,000')
print("-------------------------------------------------")
print("총합계\t\t\t\t\t\\100,000")
print("=================================================")

print(123 + 123)
print(542 - 242)
print(2 * 123)
print(120 / 3)
print("120 / 3")

print("덧셈 결과 : ",123 + 123)

print("뺄셈 결과 : ",542 - 242)

print("곱셈 결과 : ",2 * 123)

print("나눗셈 결과 : ",120 / 3)

print("12 + 54 =", 12+54, "입니다")
print("268 - 42 =", 268-42, "입니다")
print("2 * 23 =", 2*23, "입니다")
print("120 / 3 =", 120/3, "입니다")