print(0b01111011)
print(0o173)
print(0x7b)
print(123)

print("2진수 : ",bin(0b01111011))

print("8진수 : ",oct(0b01111011))

print("16진수 : ",hex(0b01111011))

print("10진수 : ",0b01111011)

print("%d" % 123)

#print("%d %d" % 123)

#print(" %d " % (123 , 321))

print("%d %d " % (123 , 321))

print("%d + %d = %d" % (123 , 321 , 123 + 321))

print(" 10진 정수 : %d" % 123)
print(" 10진 정수 : %d" % 0o173)
print(" 10진 정수 : %d" % 0x7b)

print(" 8진 정수 : %o" % 123)
print(" 8진 정수 : %o" % 0o173)
print(" 8진 정수 : %o" % 0x7b)

print(" 16진 정수 : %x" % 123)
print(" 16진 정수 : %x" % 0o173)
print(" 16진 정수 : %x" % 0x7b)

print(" 정수 표현 : %d" % 123)
print(" 정수 표현 : %d" % 123.623)
print(" 정수 표현 : %d %d" % (123,456))

print("\n 실수 표현 : %f" % 456)
print(" 실수 표현 : %f" % 456.456)
print(" 실수 표현 : %f %f" % (456.456 , 123.123))

print(" 문자 표현 : %c %c" % (65,97)) #아스키코드
print(" 문자 표현 : %c %c" % ('표','현'))

print("\n 문자열 표현 : %s" % "안녕")
print(" 문자열 표현 : %s\t%s" % ("문자열",'표현방식'))

print("기본 값 :%d" % 123)

print("설정 값 :%5d" % 123)

print("설정 값 :%05d" % 123)

print("설정 값 :%5d%5d" % (123,123))

print("설정 값 :%-5d%-5d" % (123,123))

print("기본 값 :%f" % 123.45678)

print("설정 값 : %10.3f" % 123.45678)

print("설정 값 :%2.1f" % 123.45678)

print("설정 값 :%.2f" % 123.45678)

print("1234567890123456789012345678901234567890")
print("%10s%10s"%("대한독립", "만세"))
print("기본 값 :%s" % "python test")

print("설정 값 :%20s" % "python test")


print("========== 출력 결과 ==========\n")
print("이름 :%s" % "홍길동" )
print("나이 :%d" % 20)
print("Tel :%03d-%d-%d" % (10,1234,1234))
print("키 :%1f" % 178.5)
print("몸무게%3c%d" % (":",75) )
print("혈액형%3c%c" % (":",'O'))



